IDEA StatiCa Open Model
RebarHookBase Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents a base class for rebar hook in 3D.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.RebarHookBase
 IdeaRS.OpenModel.Model.RebarHookBend
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class RebarHookBase : OpenObject
Public MustInherit Class RebarHookBase
	Inherits OpenObject
public ref class RebarHookBase abstract : public OpenObject
The RebarHookBase type exposes the following members.
Constructors
Name | Description
RebarHookBase
Initializes a new instance of the RebarHookBase class
Top
Properties
Name | Description
AxisY
 Gets or sets the position (direction) of the hook in 3D. It representa a Local Coordinate System. Hook lie in X-Y Plane. AxisX is defined by first/last segment of the rebar. AxisX and AxisY creates a plane where the hook lies.
Reverse
 Reverse direction of the hook
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace